<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"362e088503851efc0607632fef9d917caaf0414b1a306e2dca61ba7e072c7eb1","plan_job_ref":"Job terraform plan #97 at https://github.com/suzutan/infra/actions/runs/14412501806","plan_out_hash":"e8a1278a90bc6b70801b55091827bd1e248dc7eefca70bc7f76f871fc4239aa2","plan_hash":"63031c1c3bd0b49fac9c9b8f0cb0564d29704fc1101d4f459e54ea4450fd2a6e","plan_text_format":"diff","version":"1.48.0"} -->
Terraform plan in __terraform/suzutan.jp__
<details>
<summary>Plan: 0 to add, 12 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # cloudflare_dns_record.atria will be updated in-place
!~  resource "cloudflare_dns_record" "atria" {
+       comment             = (known after apply)
+       comment_modified_on = (known after apply)
!~      created_on          = "2025-03-09T15:29:11Z" -> (known after apply)
+       data                = (known after apply)
        id                  = "5c2bd30962c7b1f013b9dd3eacb33356"
!~      meta                = jsonencode({}) -> (known after apply)
!~      modified_on         = "2025-04-10T19:52:38Z" -> (known after apply)
!~      name                = "atria.suzutan.jp" -> "atria"
!~      proxiable           = true -> (known after apply)
!~      settings            = {
+           flatten_cname = (known after apply)
+           ipv4_only     = (known after apply)
+           ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
+       tags_modified_on    = (known after apply)
#        (5 unchanged attributes hidden)
    }

  # cloudflare_dns_record.bluesky_site_verification will be updated in-place
!~  resource "cloudflare_dns_record" "bluesky_site_verification" {
+       comment             = (known after apply)
+       comment_modified_on = (known after apply)
!~      created_on          = "2025-03-09T15:29:11Z" -> (known after apply)
+       data                = (known after apply)
        id                  = "e895419ec0a8ee15e34fbc09adf0e58f"
!~      meta                = jsonencode({}) -> (known after apply)
!~      modified_on         = "2025-03-09T15:29:11Z" -> (known after apply)
!~      name                = "_atproto.suzutan.jp" -> "_atproto"
!~      proxiable           = false -> (known after apply)
!~      settings            = {
+           flatten_cname = (known after apply)
+           ipv4_only     = (known after apply)
+           ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
+       tags_modified_on    = (known after apply)
#        (5 unchanged attributes hidden)
    }

  # cloudflare_dns_record.osk_nw will be updated in-place
!~  resource "cloudflare_dns_record" "osk_nw" {
+       comment             = (known after apply)
+       comment_modified_on = (known after apply)
!~      created_on          = "2025-03-09T15:29:11Z" -> (known after apply)
+       data                = (known after apply)
        id                  = "3bf9b747c9c154c527790ecf3a54fdd1"
!~      meta                = jsonencode({}) -> (known after apply)
!~      modified_on         = "2025-03-09T15:29:11Z" -> (known after apply)
!~      name                = "osk.nw.suzutan.jp" -> "osk.nw"
!~      proxiable           = false -> (known after apply)
!~      settings            = {
+           flatten_cname = (known after apply)
+           ipv4_only     = (known after apply)
+           ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
+       tags_modified_on    = (known after apply)
#        (5 unchanged attributes hidden)
    }

  # cloudflare_dns_record.rt_osk_nw will be updated in-place
!~  resource "cloudflare_dns_record" "rt_osk_nw" {
+       comment             = (known after apply)
+       comment_modified_on = (known after apply)
!~      created_on          = "2025-03-09T15:29:11Z" -> (known after apply)
+       data                = (known after apply)
        id                  = "e65f8dd460b681cc4b40c1374b46fa3a"
!~      meta                = jsonencode({}) -> (known after apply)
!~      modified_on         = "2025-03-09T15:29:11Z" -> (known after apply)
!~      name                = "rt.osk.nw.suzutan.jp" -> "rt.osk.nw"
!~      proxiable           = false -> (known after apply)
!~      settings            = {
+           flatten_cname = (known after apply)
+           ipv4_only     = (known after apply)
+           ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
+       tags_modified_on    = (known after apply)
#        (5 unchanged attributes hidden)
    }

  # cloudflare_dns_record.silverstone_osk_nw will be updated in-place
!~  resource "cloudflare_dns_record" "silverstone_osk_nw" {
+       comment             = (known after apply)
+       comment_modified_on = (known after apply)
!~      created_on          = "2025-03-09T15:29:12Z" -> (known after apply)
+       data                = (known after apply)
        id                  = "43b42c6197c284982da97f6989ce6318"
!~      meta                = jsonencode({}) -> (known after apply)
!~      modified_on         = "2025-03-09T15:29:12Z" -> (known after apply)
!~      name                = "silverstone.osk.nw.suzutan.jp" -> "silverstone.osk.nw"
!~      proxiable           = false -> (known after apply)
!~      settings            = {
+           flatten_cname = (known after apply)
+           ipv4_only     = (known after apply)
+           ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
+       tags_modified_on    = (known after apply)
#        (5 unchanged attributes hidden)
    }

  # cloudflare_dns_record.spica will be updated in-place
!~  resource "cloudflare_dns_record" "spica" {
+       comment             = (known after apply)
+       comment_modified_on = (known after apply)
!~      created_on          = "2025-03-09T15:29:12Z" -> (known after apply)
+       data                = (known after apply)
        id                  = "f4153b36a6b37bbe6b09ca359e51f7bd"
!~      meta                = jsonencode({}) -> (known after apply)
!~      modified_on         = "2025-04-10T19:52:38Z" -> (known after apply)
!~      name                = "spica.suzutan.jp" -> "spica"
!~      proxiable           = true -> (known after apply)
!~      settings            = {
+           flatten_cname = (known after apply)
+           ipv4_only     = (known after apply)
+           ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
+       tags_modified_on    = (known after apply)
#        (5 unchanged attributes hidden)
    }

  # module.fastmail.cloudflare_dns_record.dkim_1 will be updated in-place
!~  resource "cloudflare_dns_record" "dkim_1" {
+       comment             = (known after apply)
+       comment_modified_on = (known after apply)
!~      created_on          = "2025-03-09T15:29:11Z" -> (known after apply)
+       data                = (known after apply)
        id                  = "654932b422d1a6533d9bcdb9b962b7ed"
!~      meta                = jsonencode({}) -> (known after apply)
!~      modified_on         = "2025-04-10T19:52:38Z" -> (known after apply)
!~      name                = "fm1._domainkey.suzutan.jp" -> "fm1._domainkey"
!~      proxiable           = true -> (known after apply)
!~      settings            = {
+           flatten_cname = (known after apply)
+           ipv4_only     = (known after apply)
+           ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
+       tags_modified_on    = (known after apply)
#        (5 unchanged attributes hidden)
    }

  # module.fastmail.cloudflare_dns_record.dkim_2 will be updated in-place
!~  resource "cloudflare_dns_record" "dkim_2" {
+       comment             = (known after apply)
+       comment_modified_on = (known after apply)
!~      created_on          = "2025-03-09T15:29:11Z" -> (known after apply)
+       data                = (known after apply)
        id                  = "14c23245d57c2d0bbb8e4dd9a1692105"
!~      meta                = jsonencode({}) -> (known after apply)
!~      modified_on         = "2025-04-10T19:52:38Z" -> (known after apply)
!~      name                = "fm2._domainkey.suzutan.jp" -> "fm2._domainkey"
!~      proxiable           = true -> (known after apply)
!~      settings            = {
+           flatten_cname = (known after apply)
+           ipv4_only     = (known after apply)
+           ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
+       tags_modified_on    = (known after apply)
#        (5 unchanged attributes hidden)
    }

  # module.fastmail.cloudflare_dns_record.dkim_3 will be updated in-place
!~  resource "cloudflare_dns_record" "dkim_3" {
+       comment             = (known after apply)
+       comment_modified_on = (known after apply)
!~      created_on          = "2025-03-09T15:29:12Z" -> (known after apply)
+       data                = (known after apply)
        id                  = "5506623f8b54278f671530d9cd8874d5"
!~      meta                = jsonencode({}) -> (known after apply)
!~      modified_on         = "2025-04-10T19:52:39Z" -> (known after apply)
!~      name                = "fm3._domainkey.suzutan.jp" -> "fm3._domainkey"
!~      proxiable           = true -> (known after apply)
!~      settings            = {
+           flatten_cname = (known after apply)
+           ipv4_only     = (known after apply)
+           ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
+       tags_modified_on    = (known after apply)
#        (5 unchanged attributes hidden)
    }

  # module.fastmail.cloudflare_dns_record.mx_0 will be updated in-place
!~  resource "cloudflare_dns_record" "mx_0" {
+       comment             = (known after apply)
+       comment_modified_on = (known after apply)
!~      created_on          = "2025-03-09T15:29:11Z" -> (known after apply)
+       data                = (known after apply)
        id                  = "a73e0edf1f23cd8796c9b8562cdf9b53"
!~      meta                = jsonencode({}) -> (known after apply)
!~      modified_on         = "2025-03-09T15:29:11Z" -> (known after apply)
!~      name                = "suzutan.jp" -> "@"
!~      proxiable           = false -> (known after apply)
!~      settings            = {
+           flatten_cname = (known after apply)
+           ipv4_only     = (known after apply)
+           ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
+       tags_modified_on    = (known after apply)
#        (6 unchanged attributes hidden)
    }

  # module.fastmail.cloudflare_dns_record.mx_1 will be updated in-place
!~  resource "cloudflare_dns_record" "mx_1" {
+       comment             = (known after apply)
+       comment_modified_on = (known after apply)
!~      created_on          = "2025-03-09T15:29:11Z" -> (known after apply)
+       data                = (known after apply)
        id                  = "f14b2c8669ff6fb439fc58273160eb25"
!~      meta                = jsonencode({}) -> (known after apply)
!~      modified_on         = "2025-03-09T15:29:11Z" -> (known after apply)
!~      name                = "suzutan.jp" -> "@"
!~      proxiable           = false -> (known after apply)
!~      settings            = {
+           flatten_cname = (known after apply)
+           ipv4_only     = (known after apply)
+           ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
+       tags_modified_on    = (known after apply)
#        (6 unchanged attributes hidden)
    }

  # module.fastmail.cloudflare_dns_record.spf will be updated in-place
!~  resource "cloudflare_dns_record" "spf" {
+       comment             = (known after apply)
+       comment_modified_on = (known after apply)
!~      created_on          = "2025-03-09T15:29:12Z" -> (known after apply)
+       data                = (known after apply)
        id                  = "7531b81b148f28f7a6a65e7b52c15944"
!~      meta                = jsonencode({}) -> (known after apply)
!~      modified_on         = "2025-03-09T15:29:12Z" -> (known after apply)
!~      name                = "suzutan.jp" -> "@"
!~      proxiable           = false -> (known after apply)
!~      settings            = {
+           flatten_cname = (known after apply)
+           ipv4_only     = (known after apply)
+           ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
+       tags_modified_on    = (known after apply)
#        (5 unchanged attributes hidden)
    }

Plan: 0 to add, 12 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [terraform plan #97](https://github.com/suzutan/infra/actions/runs/14412501806)